app/Providers/AppServiceProvider.php

    public function boot(): void
    {

        Paginator::useBootstrapFive();

        Gate::define('has', function ($user, $role) {
            $user_role = role::find(auth()->user()->role_id);
---
select * from `roles` where `roles`.`id` = 1 limit 1